# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 10 # number of classes
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, nn.Conv2d, [64, 7, 2, 3]], # 0-P1/2
    [-1, 1, nn.BatchNorm2d, [64]], # 1-P2/4
    [-1, 1, nn.ReLU, []],
    [-1, 1, nn.MaxPool2d, [3, 2, 1]], # 3-P3/8
    [-1, 2, ResnetBlock, [64, 1]],
    [-1, 2, ResnetBlock, [128, 2]], # 5-P4/16
    [-1, 2, ResnetBlock, [256, 2]],
    [-1, 2, ResnetBlock, [512, 2]], # 7-P5/32
    [-1, 1, nn.AdaptiveAvgPool2d, [1]],
    [-1, 1, Linear, [1000]], # 9
  ]

## YOLOv5 v6.0 head
#head: [
#    [-1, 1, Conv, [512, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#    [[-1, 6], 1, Concat, [1]], # cat backbone P4
#    [-1, 3, C3, [512, False]], # 13
#  ]

